{
  "experiences": [
    {
      "role": "Senior Data Scientist | Bioinformatics | Postdoctoral Researcher",
      "location": "Max Delbrück Center for Molecular Medicine, Berlin",
      "startDate": "2018-06",
      "endDate": "2024-07",
      "image": "mdc.jpg",
      "tasks": [
        "Applied machine learning, data science and bioinformatic techniques to uncover insights in genome structure and gene regulation.",
        "Implemented end-to-end ETL pipelines for large-scale, heterogeneous omics datasets (ATAC-seq, ChIP-seq, RNA-seq, proteomics, GAM, Hi-C). Automated data ingestion, cleaning, normalization, transformation, and feature engineering. Optimized data storage and retrieval.",
        "Led and managed end-to-end AI and data-driven research projects, applying advanced statistical and machine learning techniques, resulting in 8 publications in top-tier journals like Nature and Nature Methods (200+ citations).",
        "Secured €100,000 in research funding and established collaborations with three research institutions, presenting findings at international conferences."
      ],
      "link": "https://www.mdc-berlin.de/"
    },
    {
      "role": "Data Scientist | Software Developer | Bioinformatics",
      "location": "CABD, Seville",
      "startDate": "2013-10",
      "endDate": "2018-05",
      "image": "cabd.jpeg",
      "tasks": [ 
        "Applied machine learning, statistical and optimization algorithms in simulations to generate 3D models and predict protein and genome structures.",
        "Designed end-to-end ETL pipelines for large-scale, heterogeneous omics datasets (ATAC-seq, ChIP-seq, RNA-seq, Hi-C, 4C-seq). Automated data ingestion, cleaning, normalization, transformation, and feature engineering.",
        "Developed a novel open-source 3D modeling bioinformatic algorithm using AI techniques (https://github.com/batxes/4Cin), adopted by 10+ international research projects, showcasing expertise in algorithm development and modeling.",
        "Led data analysis and software development in cross-functional teams, resulting in three first-author publications (Cell, Nature Genetics and Plos Comp. Bio.) with a combined impact factor of 90+.",
        "Managed the High-Performance Computing (HPC) infrastructure at the university, providing technical support to 100+ users, optimizing computational workflows, and improving resource efficiency.",
        "Instructed 20+ master's students in R/Linux programming, achieving 72% positive feedback score."
      ],
      "link": "https://www.cabd.es/en/"
    },
    {
      "role": "Software Engineer",
      "location": "Accenture (Banking), Madrid",
      "startDate": "2011-09",
      "endDate": "2012-08",
      "image": "accenture.jpg",
      "tasks": ["Maintained and developed critical banking applications serving 100+ daily users with 99.9% uptime."
      ],
      "link": "https://www.accenture.com/es-es"
    },

    {
      "role": "Software/Web Developer",
      "location": "Mon Digital (IT Company), Madrid",
      "startDate": "2011-05",
      "endDate": "2011-10",
      "image": "ramirez.jpg",
      "tasks": ["Developed web crawlers which led to the deployment of a high-traffic website in Brazil."
      ],
      "link": ""
    },

    {
      "role": "Software Developer | Embedded Systems",
      "location": "ETIC (Microsoft), Arrasate-Mondragon",
      "startDate": "2008-09",
      "endDate": "2009-07",
      "image": "etic.jpg",
      "tasks": [" Developed software for an embedded system that served as the foundation for a prototype, which was later commercialized, demonstrating its practical viability and market potential."
      ],
      "link": "https://www.euskadi.eus/gobierno-vasco/-/entidad/etic-embedded-technologies-innovation-center-s-coop/"
    }
  ]
}
